# 1. Поработайте с переменными, создайте несколько, выведите на экран, запросите у пользователя несколько чисел и строк
# и сохраните в переменные, выведите на экран
peremennaya_1 = 5
peremennaya_2 = 28
print("Первая переменная: ", peremennaya_1)
print("Вторая переменная: ", peremennaya_2)

peremennaya_3 = int(input("Введите число: "))
peremennaya_4 = int(input("Введите ещё число: "))



#2. Пользователь вводит время в секундах. Переведите время в часы, минуты и секунды и выведите в формате чч:мм:сс.
# Используйте форматирование строк.
